# Kelompok 3

RAID MUHAMMAD NAUFAL 	122450027\
RANI PUSPITA SARI		122450030\
Hermawan Manurung 		122450069\
Dearni monica Br Manik 	122450075\
KHUSNUN NISA 			122450078\
ANWAR MUSLIM			122450117\
YOHANA MANIK			122450126

# Import Library

In [1]:
import os
import pymysql
import sqlalchemy

# Membuat Koneksi SQL

In [2]:
db_host = "localhost"
db_username = "root"
db_password = "Basdat123"

In [3]:
try:
    conn = pymysql.connect(host = db_host,
                          port = int(3306),
                          user = 'root',
                          passwd = db_password)
except e:
    print(e)
    
if conn:
    print("Successfully Connected")
else:
    print("Error")

# Activate magic function
%load_ext sql
%sql mysql+pymysql://root:{db_password}@{db_host}

# SQLAlchemy engine
engine = sqlalchemy.create_engine(f'mysql+pymysql://root:{db_password}@{db_host}')

Successfully Connected

# ERD

<div style="text-align:center">
    <img src="https://lh3.google.com/u/0/d/1gqZAatttXHWyIyCXr0oBLVM4H5yvb2a-=w1920-h928-iv2">
</div>

# CREATE

## Membuat Database Toko Elektronik

In [4]:
%%sql 
CREATE DATABASE IF NOT EXISTS toko_elektronik;
USE toko_elektronik;

 * mysql+pymysql://root:***@localhost
1 rows affected.
0 rows affected.

[]

## Membuat Tabel 1NF

In [5]:
%%sql
CREATE TABLE IF NOT EXISTS utama (
    id_transaksi SERIAL,
    id_pelanggan INTEGER,
    nama_pelanggan TEXT,
    alamat_pelanggan TEXT,
    email_pelanggan TEXT,
    telepon_pelanggan TEXT,
    id_produk INTEGER,
    nama_produk TEXT,
    kategori TEXT,
    harga REAL,
    id_persediaan INTEGER,
    jumlah_persediaan INTEGER,
    lokasi_persediaan TEXT,
    id_supplier INTEGER,
    nama_supplier TEXT,
    kontak_supplier TEXT,
    id_pengadaan INTEGER,
    tanggal_pengadaan DATE,
    jumlah_pengadaan INTEGER,
    harga_satuan_pengadaan REAL,
    jumlah INTEGER,
    tanggal_transaksi DATE
);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

### Menyisipkan Data

In [6]:
%%sql
INSERT INTO 
    utama(id_pelanggan, nama_pelanggan, alamat_pelanggan, email_pelanggan, telepon_pelanggan, id_produk, nama_produk, kategori, harga, id_persediaan, jumlah_persediaan, lokasi_persediaan, id_supplier, nama_supplier, kontak_supplier, id_pengadaan, 
          tanggal_pengadaan, jumlah_pengadaan, harga_satuan_pengadaan, jumlah, tanggal_transaksi) 
VALUES
    (1, 'John Doe', 'Jl. Raya No. 123', 'john.doe@example.com', '0812345678', 1, 'Laptop ASUS', 'Laptop', 1200.00, 101, 15, 'Gudang A', 201, 'PT. Tekno', '08123456789', 301, '2024-05-01', 5, 1100.00, 2, '2024-05-10'),
    (2, 'Jane Smith', 'Jl. Maju Mundur No. 456', 'jane.smith@example.com', '0823456789', 2, 'Mouse Wireless', 'Elektronik', 120.00, 102, 30, 'Gudang A', 201, 'PT. Tekno', '08123456789', 302, '2024-05-01', 5, 100.00, 3, '2024-05-11'),
    (3, 'Alice Johnson', 'Jl. Indah No. 789', 'alice.johnson@example.com', '0834567890', 3, 'Keyboard Gaming', 'Elektronik', 100.00, 103, 20, 'Gudang B', 202, 'CV. Inovasi', '08234567890', 303, '2024-05-02', 10, 90.00,  1, '2024-05-12'),
    (4, 'Bob Brown', 'Jl. Bahagia No. 101112', 'bob.brown@example.com', '0845678901', 4, 'Smartphone Samsung', 'Smartphone', 800.00, 104, 25, 'Gudang C', 203, 'PT. Pintar', '08345678901', 304, '2024-05-03', 15, 750.00, 5, '2024-05-13'),
    (5, 'Emily Davis', 'Jl. Ceria No. 131415', 'emily.davis@example.com', '0856789012', 5, 'Speaker Bluetooth', 'Elektronik', 50.00, 105, 30, 'Gudang D', 204, 'UD. Suara Jaya', '08456789012', 305, '2024-05-04', 20, 40.00, 4, '2024-05-14'),
    (1, 'John Doe', 'Jl. Raya No. 123', 'john.doe@example.com', '0812345678', 2, 'Mouse Wireless', 'Elektronik', 120.00, 102, 30, 'Gudang A', 201, 'PT. Tekno', '08123456789', 302, '2024-05-01', 5, 100.00, 5, '2024-05-15'),
    (2, 'Jane Smith', 'Jl. Maju Mundur No. 456', 'jane.smith@example.com', '0823456789', 3, 'Keyboard Gaming', 'Elektronik', 100.00, 103, 20, 'Gudang B', 202, 'CV. Inovasi', '08234567890', 303, '2024-05-02', 10, 90.00, 2, '2024-05-16'),
    (3, 'Alice Johnson', 'Jl. Indah No. 789', 'alice.johnson@example.com', '0834567890', 4, 'Smartphone Samsung', 'Smartphone', 800.00, 104, 25, 'Gudang C', 203, 'PT. Pintar', '08345678901', 304, '2024-05-03', 15, 750.00, 3, '2024-05-17'),
    (4, 'Bob Brown', 'Jl. Bahagia No. 101112', 'bob.brown@example.com', '0845678901', 5, 'Speaker Bluetooth', 'Elektronik', 50.00, 105, 30, 'Gudang D', 204, 'UD. Suara Jaya', '08456789012', 305, '2024-05-04', 20, 40.00, 1, '2024-05-18'),
    (5, 'Emily Davis', 'Jl. Ceria No. 131415', 'emily.davis@example.com', '0856789012', 6, 'Powerbank', 'Elektronik', 30.00, 106, 35, 'Gudang E', 205, 'PT. Energi Teknologi', '08567890123', 306, '2024-05-05', 25, 25.00, 4, '2024-05-19')

 * mysql+pymysql://root:***@localhost
10 rows affected.

[]

In [7]:
%%sql
SELECT * FROM utama;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 1, 'John Doe', 'Jl. Raya No. 123', 'john.doe@example.com', '0812345678', 1, 'Laptop ASUS', 'Laptop', 1200.0, 101, 15, 'Gudang A', 201, 'PT. Tekno', '08123456789', 301, datetime.date(2024, 5, 1), 5, 1100.0, 2, datetime.date(2024, 5, 10)),
 (2, 2, 'Jane Smith', 'Jl. Maju Mundur No. 456', 'jane.smith@example.com', '0823456789', 2, 'Mouse Wireless', 'Elektronik', 120.0, 102, 30, 'Gudang A', 201, 'PT. Tekno', '08123456789', 302, datetime.date(2024, 5, 1), 5, 100.0, 3, datetime.date(2024, 5, 11)),
 (3, 3, 'Alice Johnson', 'Jl. Indah No. 789', 'alice.johnson@example.com', '0834567890', 3, 'Keyboard Gaming', 'Elektronik', 100.0, 103, 20, 'Gudang B', 202, 'CV. Inovasi', '08234567890', 303, datetime.date(2024, 5, 2), 10, 90.0, 1, datetime.date(2024, 5, 12)),
 (4, 4, 'Bob Brown', 'Jl. Bahagia No. 101112', 'bob.brown@example.com', '0845678901', 4, 'Smartphone Samsung', 'Smartphone', 800.0, 104, 25, 'Gudang C', 203, 'PT. Pintar', '08345678901', 304, datetime.date(2024, 5, 3), 15, 750.0, 5, datetime.date(2024, 5, 13)),
 (5, 5, 'Emily Davis', 'Jl. Ceria No. 131415', 'emily.davis@example.com', '0856789012', 5, 'Speaker Bluetooth', 'Elektronik', 50.0, 105, 30, 'Gudang D', 204, 'UD. Suara Jaya', '08456789012', 305, datetime.date(2024, 5, 4), 20, 40.0, 4, datetime.date(2024, 5, 14)),
 (6, 1, 'John Doe', 'Jl. Raya No. 123', 'john.doe@example.com', '0812345678', 2, 'Mouse Wireless', 'Elektronik', 120.0, 102, 30, 'Gudang A', 201, 'PT. Tekno', '08123456789', 302, datetime.date(2024, 5, 1), 5, 100.0, 5, datetime.date(2024, 5, 15)),
 (7, 2, 'Jane Smith', 'Jl. Maju Mundur No. 456', 'jane.smith@example.com', '0823456789', 3, 'Keyboard Gaming', 'Elektronik', 100.0, 103, 20, 'Gudang B', 202, 'CV. Inovasi', '08234567890', 303, datetime.date(2024, 5, 2), 10, 90.0, 2, datetime.date(2024, 5, 16)),
 (8, 3, 'Alice Johnson', 'Jl. Indah No. 789', 'alice.johnson@example.com', '0834567890', 4, 'Smartphone Samsung', 'Smartphone', 800.0, 104, 25, 'Gudang C', 203, 'PT. Pintar', '08345678901', 304, datetime.date(2024, 5, 3), 15, 750.0, 3, datetime.date(2024, 5, 17)),
 (9, 4, 'Bob Brown', 'Jl. Bahagia No. 101112', 'bob.brown@example.com', '0845678901', 5, 'Speaker Bluetooth', 'Elektronik', 50.0, 105, 30, 'Gudang D', 204, 'UD. Suara Jaya', '08456789012', 305, datetime.date(2024, 5, 4), 20, 40.0, 1, datetime.date(2024, 5, 18)),
 (10, 5, 'Emily Davis', 'Jl. Ceria No. 131415', 'emily.davis@example.com', '0856789012', 6, 'Powerbank', 'Elektronik', 30.0, 106, 35, 'Gudang E', 205, 'PT. Energi Teknologi', '08567890123', 306, datetime.date(2024, 5, 5), 25, 25.0, 4, datetime.date(2024, 5, 19))]

## Membuat Tabel 2NF

### Tabel Pelanggan

In [8]:
%%sql
CREATE TABLE IF NOT EXISTS pelanggan (
    id_pelanggan INTEGER PRIMARY KEY,
    nama_pelanggan TEXT,
    alamat_pelanggan TEXT,
    email_pelanggan TEXT,
    telepon_pelanggan TEXT
)
AS
SELECT DISTINCT
    id_pelanggan,
    nama_pelanggan,
    alamat_pelanggan,
    email_pelanggan,
    telepon_pelanggan
FROM
    utama;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[]

In [9]:
%%sql
SELECT * FROM pelanggan;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'John Doe', 'Jl. Raya No. 123', 'john.doe@example.com', '0812345678'),
 (2, 'Jane Smith', 'Jl. Maju Mundur No. 456', 'jane.smith@example.com', '0823456789'),
 (3, 'Alice Johnson', 'Jl. Indah No. 789', 'alice.johnson@example.com', '0834567890'),
 (4, 'Bob Brown', 'Jl. Bahagia No. 101112', 'bob.brown@example.com', '0845678901'),
 (5, 'Emily Davis', 'Jl. Ceria No. 131415', 'emily.davis@example.com', '0856789012')]

### Tabel Produk

In [10]:
%%sql
CREATE TABLE IF NOT EXISTS produk (
    id_produk INTEGER PRIMARY KEY,
    nama_produk TEXT,
    kategori TEXT,
    harga REAL,
    id_persediaan INTEGER,
    jumlah_persediaan INTEGER,
    lokasi_persediaan TEXT,
    id_supplier INTEGER,
    nama_supplier TEXT,
    kontak_supplier TEXT,
    id_pengadaan INTEGER,
    tanggal_pengadaan DATE,
    jumlah_pengadaan INTEGER,
    harga_satuan_pengadaan REAL
)
AS
SELECT DISTINCT
    id_produk,
    nama_produk,
    kategori,
    harga,
    id_persediaan, 
    jumlah_persediaan, 
    lokasi_persediaan, 
    id_supplier,
    nama_supplier,
    kontak_supplier,
    id_pengadaan, 
    tanggal_pengadaan, 
    jumlah_pengadaan, 
    harga_satuan_pengadaan
FROM 
    utama;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[]

In [11]:
%%sql
SELECT * FROM produk;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(1, 'Laptop ASUS', 'Laptop', 1200.0, 101, 15, 'Gudang A', 201, 'PT. Tekno', '08123456789', 301, datetime.date(2024, 5, 1), 5, 1100.0),
 (2, 'Mouse Wireless', 'Elektronik', 120.0, 102, 30, 'Gudang A', 201, 'PT. Tekno', '08123456789', 302, datetime.date(2024, 5, 1), 5, 100.0),
 (3, 'Keyboard Gaming', 'Elektronik', 100.0, 103, 20, 'Gudang B', 202, 'CV. Inovasi', '08234567890', 303, datetime.date(2024, 5, 2), 10, 90.0),
 (4, 'Smartphone Samsung', 'Smartphone', 800.0, 104, 25, 'Gudang C', 203, 'PT. Pintar', '08345678901', 304, datetime.date(2024, 5, 3), 15, 750.0),
 (5, 'Speaker Bluetooth', 'Elektronik', 50.0, 105, 30, 'Gudang D', 204, 'UD. Suara Jaya', '08456789012', 305, datetime.date(2024, 5, 4), 20, 40.0),
 (6, 'Powerbank', 'Elektronik', 30.0, 106, 35, 'Gudang E', 205, 'PT. Energi Teknologi', '08567890123', 306, datetime.date(2024, 5, 5), 25, 25.0)]

### Tabel Transaksi

In [12]:
%%sql
CREATE TABLE IF NOT EXISTS transaksi (
    id_transaksi INTEGER PRIMARY KEY,
    id_pelanggan INTEGER REFERENCES pelanggan(id_pelanggan),
    id_produk INTEGER REFERENCES produk(id_produk),
    jumlah INTEGER,
    tanggal_transaksi DATE
)
AS
SELECT DISTINCT
    id_transaksi,
    id_pelanggan,
    id_produk,
    jumlah,
    tanggal_transaksi
FROM 
    utama;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[]

In [13]:
%%sql
SELECT * FROM transaksi;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 1, 1, 2, datetime.date(2024, 5, 10)),
 (2, 2, 2, 3, datetime.date(2024, 5, 11)),
 (3, 3, 3, 1, datetime.date(2024, 5, 12)),
 (4, 4, 4, 5, datetime.date(2024, 5, 13)),
 (5, 5, 5, 4, datetime.date(2024, 5, 14)),
 (6, 1, 2, 5, datetime.date(2024, 5, 15)),
 (7, 2, 3, 2, datetime.date(2024, 5, 16)),
 (8, 3, 4, 3, datetime.date(2024, 5, 17)),
 (9, 4, 5, 1, datetime.date(2024, 5, 18)),
 (10, 5, 6, 4, datetime.date(2024, 5, 19))]

## Membuat Tabel 3NF

### Tabel Persediaan

In [16]:
%%sql
CREATE TABLE IF NOT EXISTS persediaan (
    id_persediaan INTEGER PRIMARY KEY,
    jumlah_persediaan INTEGER,
    lokasi_persediaan TEXT
)
AS
SELECT DISTINCT
    id_persediaan, 
    jumlah_persediaan, 
    lokasi_persediaan
FROM 
    utama;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[]

In [17]:
%%sql
SELECT * FROM persediaan;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(101, 15, 'Gudang A'),
 (102, 30, 'Gudang A'),
 (103, 20, 'Gudang B'),
 (104, 25, 'Gudang C'),
 (105, 30, 'Gudang D'),
 (106, 35, 'Gudang E')]

### Tabel Supplier

In [18]:
%%sql
CREATE TABLE IF NOT EXISTS supplier (
    id_supplier INTEGER PRIMARY KEY,
    nama_supplier TEXT,
    kontak_supplier TEXT
)
AS
SELECT DISTINCT
    id_supplier,
    nama_supplier,
    kontak_supplier
FROM 
    utama;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[]

In [19]:
%%sql
SELECT * FROM supplier;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(201, 'PT. Tekno', '08123456789'),
 (202, 'CV. Inovasi', '08234567890'),
 (203, 'PT. Pintar', '08345678901'),
 (204, 'UD. Suara Jaya', '08456789012'),
 (205, 'PT. Energi Teknologi', '08567890123')]

### Tabel Pengadaan

In [20]:
%%sql 
CREATE TABLE IF NOT EXISTS pengadaan (
    id_pengadaan INTEGER PRIMARY KEY,
    tanggal_pengadaan DATE,
    jumlah_pengadaan INTEGER,
    harga_satuan_pengadaan REAL
)
AS
SELECT DISTINCT
    id_pengadaan,
    tanggal_pengadaan,
    jumlah_pengadaan,
    harga_satuan_pengadaan
FROM 
    utama;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[]

In [21]:
%%sql
SELECT * FROM pengadaan;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(301, datetime.date(2024, 5, 1), 5, 1100.0),
 (302, datetime.date(2024, 5, 1), 5, 100.0),
 (303, datetime.date(2024, 5, 2), 10, 90.0),
 (304, datetime.date(2024, 5, 3), 15, 750.0),
 (305, datetime.date(2024, 5, 4), 20, 40.0),
 (306, datetime.date(2024, 5, 5), 25, 25.0)]

### Tabel Produk

In [22]:
%%sql
DROP TABLE produk;
CREATE TABLE IF NOT EXISTS produk (
    id_produk INTEGER PRIMARY KEY,
    nama_produk TEXT,
    kategori TEXT,
    harga REAL,
    id_persediaan INTEGER REFERENCES persediaan(id_persediaan),
    id_supplier INTEGER REFERENCES supplier(id_supplier),
    id_pengadaan INTEGER REFERENCES pengadaan(id_pengadaan)
)
AS
SELECT DISTINCT
    id_produk,
    nama_produk,
    kategori,
    harga,
    id_persediaan,  
    id_supplier,
    id_pengadaan
FROM 
    utama;

 * mysql+pymysql://root:***@localhost
0 rows affected.
6 rows affected.

[]

In [23]:
%%sql
SELECT * FROM produk;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(1, 'Laptop ASUS', 'Laptop', 1200.0, 101, 201, 301),
 (2, 'Mouse Wireless', 'Elektronik', 120.0, 102, 201, 302),
 (3, 'Keyboard Gaming', 'Elektronik', 100.0, 103, 202, 303),
 (4, 'Smartphone Samsung', 'Smartphone', 800.0, 104, 203, 304),
 (5, 'Speaker Bluetooth', 'Elektronik', 50.0, 105, 204, 305),
 (6, 'Powerbank', 'Elektronik', 30.0, 106, 205, 306)]

### Tabel Pelanggan

In [14]:
%%sql
SELECT * FROM pelanggan;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'John Doe', 'Jl. Raya No. 123', 'john.doe@example.com', '0812345678'),
 (2, 'Jane Smith', 'Jl. Maju Mundur No. 456', 'jane.smith@example.com', '0823456789'),
 (3, 'Alice Johnson', 'Jl. Indah No. 789', 'alice.johnson@example.com', '0834567890'),
 (4, 'Bob Brown', 'Jl. Bahagia No. 101112', 'bob.brown@example.com', '0845678901'),
 (5, 'Emily Davis', 'Jl. Ceria No. 131415', 'emily.davis@example.com', '0856789012')]

### Tabel Transaksi

In [15]:
%%sql
SELECT * FROM transaksi;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 1, 1, 2, datetime.date(2024, 5, 10)),
 (2, 2, 2, 3, datetime.date(2024, 5, 11)),
 (3, 3, 3, 1, datetime.date(2024, 5, 12)),
 (4, 4, 4, 5, datetime.date(2024, 5, 13)),
 (5, 5, 5, 4, datetime.date(2024, 5, 14)),
 (6, 1, 2, 5, datetime.date(2024, 5, 15)),
 (7, 2, 3, 2, datetime.date(2024, 5, 16)),
 (8, 3, 4, 3, datetime.date(2024, 5, 17)),
 (9, 4, 5, 1, datetime.date(2024, 5, 18)),
 (10, 5, 6, 4, datetime.date(2024, 5, 19))]

# READ

In [24]:
%%sql
SELECT * FROM pelanggan WHERE id_pelanggan = 1;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(1, 'John Doe', 'Jl. Raya No. 123', 'john.doe@example.com', '0812345678')]

In [25]:
%%sql
SELECT
    p.nama_pelanggan,
    p2.nama_produk,
    t.jumlah,
    p2.harga,
    SUM(p2.harga * t.jumlah) AS total_harga,
    t.tanggal_transaksi
FROM
    transaksi t
JOIN
    pelanggan p ON p.id_pelanggan = t.id_pelanggan
JOIN
    produk p2 ON p2.id_produk = t.id_produk
GROUP BY
    t.id_transaksi, p.id_pelanggan, p2.id_produk;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('John Doe', 'Laptop ASUS', 2, 1200.0, 2400.0, datetime.date(2024, 5, 10)),
 ('Jane Smith', 'Mouse Wireless', 3, 120.0, 360.0, datetime.date(2024, 5, 11)),
 ('Alice Johnson', 'Keyboard Gaming', 1, 100.0, 100.0, datetime.date(2024, 5, 12)),
 ('Bob Brown', 'Smartphone Samsung', 5, 800.0, 4000.0, datetime.date(2024, 5, 13)),
 ('Emily Davis', 'Speaker Bluetooth', 4, 50.0, 200.0, datetime.date(2024, 5, 14)),
 ('John Doe', 'Mouse Wireless', 5, 120.0, 600.0, datetime.date(2024, 5, 15)),
 ('Jane Smith', 'Keyboard Gaming', 2, 100.0, 200.0, datetime.date(2024, 5, 16)),
 ('Alice Johnson', 'Smartphone Samsung', 3, 800.0, 2400.0, datetime.date(2024, 5, 17)),
 ('Bob Brown', 'Speaker Bluetooth', 1, 50.0, 50.0, datetime.date(2024, 5, 18)),
 ('Emily Davis', 'Powerbank', 4, 30.0, 120.0, datetime.date(2024, 5, 19))]

# UPDATE

In [26]:
%%sql
SELECT * FROM pelanggan WHERE id_pelanggan = 4;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(4, 'Bob Brown', 'Jl. Bahagia No. 101112', 'bob.brown@example.com', '0845678901')]

In [27]:
%%sql
UPDATE
    pelanggan
SET
    telepon_pelanggan = '0818283848'
WHERE
    id_pelanggan = 4;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [28]:
%%sql
SELECT * FROM pelanggan WHERE id_pelanggan = 4;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(4, 'Bob Brown', 'Jl. Bahagia No. 101112', 'bob.brown@example.com', '0818283848')]

# DELETE

In [29]:
%%sql
SHOW TABLES;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[('pelanggan',),
 ('pengadaan',),
 ('persediaan',),
 ('produk',),
 ('supplier',),
 ('transaksi',),
 ('utama',)]

In [30]:
%%sql
DROP TABLE utama;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [31]:
%%sql
SHOW TABLES;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[('pelanggan',),
 ('pengadaan',),
 ('persediaan',),
 ('produk',),
 ('supplier',),
 ('transaksi',)]

In [32]:
%%sql
SELECT * FROM transaksi;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 1, 1, 2, datetime.date(2024, 5, 10)),
 (2, 2, 2, 3, datetime.date(2024, 5, 11)),
 (3, 3, 3, 1, datetime.date(2024, 5, 12)),
 (4, 4, 4, 5, datetime.date(2024, 5, 13)),
 (5, 5, 5, 4, datetime.date(2024, 5, 14)),
 (6, 1, 2, 5, datetime.date(2024, 5, 15)),
 (7, 2, 3, 2, datetime.date(2024, 5, 16)),
 (8, 3, 4, 3, datetime.date(2024, 5, 17)),
 (9, 4, 5, 1, datetime.date(2024, 5, 18)),
 (10, 5, 6, 4, datetime.date(2024, 5, 19))]

In [33]:
%%sql
DELETE FROM
    transaksi
WHERE
    id_transaksi = 10;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [34]:
%%sql
SELECT * FROM transaksi;

 * mysql+pymysql://root:***@localhost
9 rows affected.

[(1, 1, 1, 2, datetime.date(2024, 5, 10)),
 (2, 2, 2, 3, datetime.date(2024, 5, 11)),
 (3, 3, 3, 1, datetime.date(2024, 5, 12)),
 (4, 4, 4, 5, datetime.date(2024, 5, 13)),
 (5, 5, 5, 4, datetime.date(2024, 5, 14)),
 (6, 1, 2, 5, datetime.date(2024, 5, 15)),
 (7, 2, 3, 2, datetime.date(2024, 5, 16)),
 (8, 3, 4, 3, datetime.date(2024, 5, 17)),
 (9, 4, 5, 1, datetime.date(2024, 5, 18))]

# Kesimpulan

# Terima Kasih